{
    "docs": {
        "apworld_description": [
            "Doors Archipelago is a version of the Doors game on Roblox.",
            "What is considered a location check in doors? - Location checks are completed when you complete various achievements in Doors. You may see your achievements in the main lobby, or on the Roblox page of Doors.",
            "when the player receives an item, what happens? - When the player receives an item, they may get either a key that allows them to access an area, the ability to use an item (or multiple items), or a mechanic.",
            "What is the victory condition? - Victory is achieved when the player escapes the backdoor (aka getting Other Way Around).",
            "What are the available items? - The player can get keys for the main part of the game, or the side floors where the backdoor can be unlocked.",
            "- The Guiding Key has 4 stages, which unlock Door 50, Door 100, Door 140, Door 195. The Curious Key has 2 stages, which unlocks the rooms and then the backdoor.",
            "The player can get the ability to get items. Additionally a torn-up guide for any item that will give you the ability to use any one of these, but only once.",
            "- There are important items, like the Lockpick, Candle, Crucifix, Skeleton Key & Glowstick. There are also non-important items, like the Flashlight, Lighter, Vitamins, Alarm Clock, Shears, Straplight, Bulklight, Laser Pointer, Battery Pack, Bandage Pack, Gummy Flashlight and all of the Starlight Liquids.",
            "The player can unlock mechanics. There are currently only 3 locked mechanics.",
            "- The Rift: Allows you to use both the rift and the golden rift. - Pre-Run Shop: Allows you to buy from the Pre-Run Shop. - Modifiers: Allows you to use modifiers (and enter lobbies with modifiers).",
            "The player can get temporary items which can allow you to get an achievement prematurely.",
            "- Temporary Light-source, Allows you to use any light-emitting item, excluding the Possesed Candle. Allows you to use any Utility item, excluding the Crucifix and every light-emitting item. On use you can use the item for the rest of the run.",
            "What are the traps? - Slipped - Stand in place for 10 seconds, Attacked - Die as soon as possible without getting any achievements (excluding achievements achieved on death), Tripped - Force yourself to take damage.",
            "The Archipelago thread can be found in https://discord.com/channels/1097532591650910289/1230046028799934464"
        ],
        "_web": {
            "_comment": "for more info check github https://github.com/ArchipelagoMW/Archipelago/blob/main/docs/world%20api.md#webworld-class",
            "theme": "dirt",
            "bug_report_page": "https://discord.gg/T5bcsVHByx",
            "tutorials": [
                {
                    "name": "Multiworld Setup Guide",
                    "description": "A guide to setting up manual game integration for Archipelago multiworld games.",
                    "language": "English",
                    "file_name": "setup_en.md",
                    "link": "setup/en",
                    "_authors": ["WolfPlay013"],
                    "_comment": "if you don't include the authors it will use creator from game.json"
                }
            ],
            "_options_presets": {
                "Easy":{
                    "Option1": true,
                    "Option2": "potato"
                }
            }
        }
    },
    "_comment_":"Enable the generation of puml diagram of your apworld region and locations for debug purposes",
    "enable_region_diagram": false
}